name = input('Введите ваше имя: ')
# surname = input('Введите вашу фамилию: ')
# age = int(input('Введите ваш возраст: '))

# Определите типы данных и идентификаторы в памяти
# Дайте смысловые имена переменным
name_id = id(name)

# вывод типа и идентификатора каждой переменной
print(type(name_id))  # допишите код
# print(...)  # допишите код
# print(...)  # допишите код
# задание не сложное, не пойму что именно нужно сделать